Repository: BravoBaldo/Translations
Catalog: Yocto/Official/Yocto_OmegaT/Yocto_OmegaT-level2.tmx
Source language: en_us
Languages: it_it

source: It is worth noting that the term "package" can, in general, have subtle meanings. For example, the packages referred to in the ":ref:`ref-manual/system-requirements:required packages for the build host`" section are compiled binaries that, when installed, add functionality to your Linux distribution.
it_it: È importante notare che il termine "pacchetto" [package] può, in generale, avere significati più sfumati. Ad esempio, i pacchetti a cui si fa riferimento nella sezione ":ref:`ref-manual/system-requirements:required packages for the build host`" sono binari compilati che, una volta installati, aggiungono funzionalità alla distribuzione Linux.

source: It is worth noting that the term "package" can, in general, have subtle meanings. For example, the packages referred to in the ":ref:`ref-manual/system-requirements:required packages for the build host`" section in the Yocto Project Reference Manual are compiled binaries that, when installed, add functionality to your host Linux distribution.
it_it: Vale la pena notare che il termine "pacchetto" può, in generale, avere significati sfumati. Ad esempio, i pacchetti a cui si fa riferimento nella sezione ":ref:`ref-manual/system-requirements:required packages for the build host`" del Manuale di Riferimento di Yocto Project sono binari compilati che, una volta installati, aggiungono funzionalità alla distribuzione Linux host.

source: It may seem surprising to see a section covering an 'overall architecture' for what seems to be a random collection of tracing tools that together make up the Linux tracing and profiling space. The fact is, however, that in recent years this seemingly disparate set of tools has started to converge on a 'core' set of underlying mechanisms:
it_it: Potrebbe sembrare sorprendente trovare una sezione dedicata alla 'architettura generale' di quello che apparentemente è un insieme casuale di tool di tracing che costituiscono lo spazio di tracing e profilazione di Linux. In realtà, però, negli ultimi anni questo insieme di tool apparentemente eterogeneo ha iniziato a convergere verso un insieme "centrale" di meccanismi sottostanti:

source: It will guide you through the steps of creating the key pair.
it_it: Guiderà attraverso i passaggi per la creazione della coppia di chiavi.

source: It's also possible to trace block I/O using only :ref:`profile-manual/usage:The 'trace events' Subsystem`, which can be useful for casual tracing if you don't want to bother dealing with the user space tools.
it_it: È anche possibile tracciare l'I/O a blocchi utilizzando solo :ref:`profile-manual/usage:The 'trace events' Subsystem`, il che può essere utile per un tracing occasionale se non si desidera utilizzare gli strumenti nello spazio utente.

source: It's also possible, and more interesting in many cases, to run a system-wide profile or trace while running the workload in a separate shell.
it_it: È anche possibile, e in molti casi più interessante, eseguire un profilo o un tracciamento a livello di sistema mentre il carico di lavoro viene eseguito in una shell separata.

source: It's useful to have some idea of how the tasks defined by the :ref:`autotools* <ref-classes-autotools>` classes work and what they do behind the scenes.
it_it: È utile avere un'idea di come funzionano i task definite dalle classi :ref:`autotools* <ref-classes-autotools>` e cosa fanno dietro le quinte.

source: Judicious use of a :term:`DL_DIR` directory can save the build system a trip across the Internet when looking for files. A good method for using a download directory is to have :term:`DL_DIR` point to an area outside of your :term:`Build Directory`. Doing so allows you to safely delete the :term:`Build Directory` if needed without fear of removing any downloaded source file.
it_it: Un uso oculato della directory :term:`DL_DIR` può evitare al sistema di build di dover effettuare una ricerca su Internet per trovare i file. Un buon metodo per utilizzare una directory di download è quello di impostare :term:`DL_DIR` in modo che punti a un'area esterna alla directory :term:`Build Directory`. In questo modo è possibile eliminare in sicurezza la directory :term:`Build Directory` se necessario, senza il rischio di rimuovere i file sorgente scaricati.

source: Just provide the name of the file for which you are interested. The information returned is not ordered by history but does include a list of everyone who has committed grouped by name. From the list, you can see who is responsible for the bulk of the changes against the file.
it_it: Basta fornire il nome del file di interesse. Le informazioni restituite non sono ordinate cronologicamente, ma includono un elenco di tutti coloro che hanno effettuato commit, raggruppati per nome. Dall'elenco, è possibile vedere chi è responsabile della maggior parte delle modifiche al file.

source: Keep in mind that every patch submitted upstream reduces the maintenance burden in OpenEmbedded and Yocto Project in the long run, so this patch status should only be used in exceptional cases if there are genuine obstacles to submitting a patch upstream; the reason for that should be included in the patch.
it_it: Si tenga presente che ogni patch inviata al progetto upstream riduce il carico di manutenzione di OpenEmbedded e di Yocto Project a lungo termine, quindi questo stato della patch dovrebbe essere utilizzato solo in casi eccezionali in cui sussistono ostacoli reali all'invio di una patch al progetto upstream; la motivazione di tali ostacoli deve essere inclusa nella patch.

source: LTTng (Linux Trace Toolkit, next generation)
it_it: LTTng (Linux Trace Toolkit, nuova generazione)

source: LTTng Documentation
it_it: Documentazione di LTTng

source: LTTng Setup
it_it: Configurazione di LTTng

source: Language bindings for manipulating and aggregating trace data are of course not a new idea. One of the first projects to do this was IBM's DProbes dpcc compiler, an ANSI C compiler which targeted a low-level assembly language running on an in-kernel interpreter on the target system. This is exactly analogous to what Sun's DTrace did, except that DTrace invented its own language for the purpose. SystemTap, heavily inspired by DTrace, also created its own one-off language, but rather than running the product on an in-kernel interpreter, created an elaborate compiler-based machinery to translate its language into kernel modules written in C.
it_it: I binding di linguaggio per la manipolazione e l'aggregazione dei dati di tracciamento non sono certo un'idea nuova. Uno dei primi progetti a farlo è stato il compilatore dpcc DProbes di IBM, un compilatore ANSI C che si rivolgeva a un linguaggio assembly di basso livello in esecuzione su un interprete in-kernel del sistema target. Questo è esattamente analogo a ciò che faceva DTrace di Sun, con la differenza che DTrace ha inventato un proprio linguaggio per questo scopo. SystemTap, fortemente ispirato a DTrace, ha creato un proprio linguaggio proprietario, ma anziché eseguire il prodotto su un interprete integrato nel kernel, ha sviluppato un complesso meccanismo basato su un compilatore per tradurre il linguaggio in moduli del kernel scritti in C.

source: Lastly please ensure that you also test your revised changes. In particular please don't just edit the patch file written out by ``git format-patch`` and resend it.
it_it: Infine, si devono testare anche le modifiche apportate. In particolare, non ci si limiti a modificare il file di patch generato da ``git format-patch`` e a inviarlo nuovamente.

source: Layer Configuration File
it_it: File di Configurazione del Layer

source: Layer Source
it_it: Sorgenti dei Layer

source: Layer definitions are the most complex. The following defines each of the layers, and then defines the exact layer version of the layer used for each respective release. You must have one ``orm.layer`` entry for each layer. Then, with each entry you need a set of ``orm.layer_version`` entries that connects the layer with each release that includes the layer. In general all releases include the layer.
it_it: Le definizioni dei layer sono le più complesse. Quanto segue definisce ciascun layer e quindi specifica la versione esatta del layer utilizzata per ogni rispettiva release. È necessario avere una voce ``orm.layer`` per ogni layer. Quindi, per ogni voce è necessario un set di voci ``orm.layer_version`` che colleghino il layer a ogni release che lo include. In generale, tutte le release includono il layer.

source: Layers
it_it: Layer

source: Layers are repositories that contain related metadata (i.e. sets of instructions) that tell the OpenEmbedded build system how to build a target. :ref:`overview-manual/yp-intro:the yocto project layer model` facilitates collaboration, sharing, customization, and reuse within the Yocto Project development environment. Layers logically separate information for your project. For example, you can use a layer to hold all the configurations for a particular piece of hardware. Isolating hardware-specific configurations allows you to share other metadata by using a different layer where that metadata might be common across several pieces of hardware.
it_it: I layer sono repository che contengono metadati correlati (ovvero insiemi di istruzioni) che indicano al sistema di build OpenEmbedded come compilare un target. :ref:`overview-manual/yp-intro:the yocto project layer model` facilita la collaborazione, la condivisione, la personalizzazione e il riutilizzo all'interno dell'ambiente di sviluppo di Yocto Project. I layer separano logicamente le informazioni per il progetto. Ad esempio, si può utilizzare un layer per contenere tutte le configurazioni per un particolare componente hardware. Isolare le configurazioni specifiche dell'hardware consente di condividere altri metadati utilizzando un layer diverso laddove tali metadati potrebbero essere comuni a più componenti hardware.

source: Layers can contain changes to previous instructions or settings at any time. This powerful override capability is what allows you to customize previously supplied collaborative or community layers to suit your product requirements.
it_it: I layer possono contenere modifiche a istruzioni o impostazioni precedenti in qualsiasi momento. Questa potente capacità di override consente di personalizzare i layer collaborativi o della community precedentemente forniti per adattarli ai requisiti del proprio prodotto.

source: Layers support the inclusion of technologies, hardware components, and software components. The :ref:`Yocto Project Compatible <dev-manual/layers:making sure your layer is compatible with yocto project>` designation provides a minimum level of standardization that contributes to a strong ecosystem. "YP Compatible" is applied to appropriate products and software components such as BSPs, other OE-compatible layers, and related open-source projects, allowing the producer to use Yocto Project badges and branding assets.
it_it: I layer supportano l'inclusione di tecnologie, componenti hardware e software. La dicitura :ref:`Yocto Project Compatible <dev-manual/layers:making sure your layer is compatible with yocto project>` fornisce un layer minimo di standardizzazione che contribuisce a un solido ecosistema. La dicitura "YP Compatible" viene applicata a prodotti e componenti software appropriati, come BSP, altri layer compatibili con OpenEmbedded e progetti open source correlati, consentendo al produttore di utilizzare i badge e gli elementi di branding di Yocto Project.

source: Layers that are no longer actively supported as part of the Yocto Project appear under the heading "Yocto Metadata Layer Archive."
it_it: I layer non più attivamente supportati da Yocto Project compaiono sotto la voce "Yocto Metadata Layer Archive."

source: Learn more about the VSCode Extension on the `extension's frontpage <https://marketplace.visualstudio.com/items?itemName=yocto-project.yocto-bitbake>`__.
it_it: Scoprire di più sull'estensione VS Code sulla `pagina principale dell'estensione <https://marketplace.visualstudio.com/items?itemName=yocto-project.yocto-bitbake>`__.

source: Learn more about the VSCode Extension on the `extension's marketplace page <https://marketplace.visualstudio.com/items?itemName=yocto-project.yocto-bitbake>`__
it_it: Maggiori informazioni sull'estensione VS Code sulla `pagina del marketplace dell'estensione <https://marketplace.visualstudio.com/items?itemName=yocto-project.yocto-bitbake>`__

source: Learn more about the VSCode Extension on the `extension's marketplace page <https://marketplace.visualstudio.com/items?itemName=yocto-project.yocto-bitbake>`__.
it_it: Maggiori informazioni sull'estensione VS Code nella `pagina del marketplace dell'estensione <https://marketplace.visualstudio.com/items?itemName=yocto-project.yocto-bitbake>`__.

source: Less often, the actual licensing terms themselves will have changed. If so, do try to link to upstream making/justifying that decision.
it_it: Meno frequentemente, i termini di licenza stessi potrebbero essere cambiati. In tal caso, si consiglia di fornire un link al progetto originale che ha preso/giustificato tale decisione.

source: Let's pick one of these tracepoints and tell perf to do a profile using it as the sampling event::
it_it: Scegliamo uno di questi tracepoint e diciamo a perf di eseguire un profilo utilizzandolo come evento di campionamento::

source: Let's record system-wide (``sleep 30`` is a trick for recording system-wide but basically do nothing and then wake up after 30 seconds)::
it_it: Registriamo a livello di sistema (``sleep 30`` è un trucco per registrare a livello di sistema, ma in pratica non fa nulla e poi si riattiva dopo 30 secondi)::

source: Let's see what's inside the subdirectory for a specific tracepoint, in this case the one for ``kmalloc``::
it_it: Vediamo cosa contiene la sottocartella relativa a uno specifico tracepoint, in questo caso quello per ``kmalloc``::

source: Let's take this command as an example throughout this document.
it_it: Utilizzeremo questo comando come esempio in tutto il documento.

source: Let's test the configuration:
it_it: Testiamo la configurazione:

source: Let's verify that signature verification works:
it_it: Confermiamo che la verifica della firma funzioni:

source: License Files
it_it: File di Licenza

source: License Updates
it_it: Aggiornamenti delle Licenze

source: Licensing
it_it: Licenze

source: Licensing files can be MIT, BSD, GPLv*, and so forth. These files are recommended for the BSP but are optional and totally up to the BSP developer. For information on how to maintain license compliance, see the ":ref:`dev-manual/licenses:maintaining open source license compliance during your product's lifecycle`" section in the Yocto Project Development Tasks Manual.
it_it: I file di licenza possono essere MIT, BSD, GPLv* e così via. Questi file sono consigliati per il BSP, ma sono opzionali e la loro gestione è a completa discrezione dello sviluppatore del BSP. Per informazioni su come mantenere la conformità delle licenze, consultare la sezione ":ref:`dev-manual/licenses:maintaining open source license compliance during your product's lifecycle`" nel Manuale di Sviluppo dei Task di Yocto Project.

source: Like all package-controlling variables, you must always use them in conjunction with a package name override, as in::
it_it: Come tutte le variabili di controllo dei pacchetti, è sempre necessario utilizzarle insieme a una sovrascrittura [override] del nome del pacchetto, come nell'esempio seguente::

source: Like image generation, the SDK script process consists of several stages and depends on many variables. The :ref:`ref-tasks-populate_sdk` and :ref:`ref-tasks-populate_sdk_ext` tasks use these key variables to help create the list of packages to actually install. For information on the variables listed in the figure, see the ":ref:`overview-manual/concepts:application development sdk`" section.
it_it: Come per la generazione delle immagini, il processo di creazione degli script SDK si compone di diverse fasi e dipende da numerose variabili. I task :ref:`ref-tasks-populate_sdk` e :ref:`ref-tasks-populate_sdk_ext` utilizzano queste variabili chiave per creare l'elenco dei pacchetti da installare. Per informazioni sulle variabili elencate nella figura, consultare la sezione ":ref:`overview-manual/concepts:application development sdk`".

source: Like the :term:`WORKDIR` case, there can be situations where dependencies should be ignored. For these situations, you can instruct the build process to ignore a dependency by using a line like the following::
it_it: Analogamente al caso di :term:`WORKDIR`, possono esserci situazioni in cui le dipendenze devono essere ignorate. In questi casi, è possibile indicare al processo di compilazione di ignorare una dipendenza utilizzando una riga come la seguente::

source: Links to other SystemTap documents, tutorials, and examples can be found here: `SystemTap documentation page <https://sourceware.org/systemtap/documentation.html>`__
it_it: I link ad altri documenti, tutorial ed esempi di SystemTap sono disponibili qui: `pagina della documentazione di SystemTap <https://sourceware.org/systemtap/documentation.html>`__

source: Linux Kernel Configuration
it_it: Configurazione del Kernel Linux

source: Linux Kernel Development Manual
it_it: Manuale di Sviluppo del Kernel Linux

source: Linux kernel vulnerabilities
it_it: Vulnerabilità del kernel Linux

source: List the files in the shared state directory again:
it_it: Elenchiamo nuovamente i file nella directory dello shared state:

source: List the repositories you're planning to contribute to.
it_it: Elencare i repository a cui si intende contribuire.

source: Lists commands in a package that need an alternative binary naming scheme. Sometimes the same command is provided in multiple packages. When this occurs, the OpenEmbedded build system needs to use the alternatives system to create a different binary naming scheme so the commands can co-exist.
it_it: Elenca i comandi di un pacchetto che necessitano di uno schema di denominazione binario alternativo. A volte lo stesso comando è presente in più pacchetti. In questi casi, il sistema di build OpenEmbedded deve utilizzare il sistema di alternative per creare uno schema di denominazione binario diverso, in modo che i comandi possano coesistere.

source: Live Mode
it_it: Modalità Live

source: Local Projects
it_it: Progetti Locali

source: Local projects are custom bits of software the user provides. These bits reside somewhere local to a project --- perhaps a directory into which the user checks in items (e.g. a local directory containing a development source tree used by the group).
it_it: I progetti locali sono porzioni di software personalizzate fornite dall'utente. Queste porzioni risiedono in una posizione locale al progetto, ad esempio una directory in cui l'utente carica i file (come una directory locale contenente la struttura di directory del codice sorgente utilizzata dal gruppo).

source: Long Term Support Releases
it_it: Versioni con Supporto a Lungo Termine

source: Long variables should be split over multiple lines when possible by using the continuation character (``\``)
it_it: Le variabili long devono essere suddivise su più righe, quando possibile, utilizzando il carattere di continuazione (``\``)

source: Luckily, there is a general-purpose way to handle such needs, called "programming languages". Making programming languages easily available to apply to such problems given the specific format of data is called a 'programming language binding' for that data and language. perf supports two programming language bindings, one for Python and one for Perl.
it_it: Fortunatamente, esiste un modo generico per gestire tali esigenze, chiamato "programming languages" [linguaggi di programmazione]. Rendere i linguaggi di programmazione facilmente disponibili per l'applicazione a tali problemi, dato lo specifico formato dei dati, è chiamato 'programming language binding' per quei dati e quel linguaggio. perf supporta due binding di linguaggi di programmazione, uno per Python e uno per Perl.

source: MIPS architecture testing
it_it: Test dell'architettura MIPS

source: Maintainer(s)
it_it: Manutentori

source: Maintainers also commonly use ``-next`` branches to test submissions prior to merging patches. Thus, you can get an idea of the status of a patch based on whether the patch has been merged into one of these branches. The commonly used testing branches for OpenEmbedded-Core are as follows:
it_it: I manutentori utilizzano comunemente anche i branch ``-next`` per testare le modifiche prima di unire le patch. Pertanto, è possibile farsi un'idea dello stato di una patch in base al fatto che sia stata unita o meno a uno di questi branch. I branch di test comunemente utilizzati per OpenEmbedded-Core sono i seguenti:

source: Major Release Codenames
it_it: Nomi in Codice delle Release Major

source: Major and Minor Release Cadence
it_it: Cadenza dei Rilasci Major e Minor

source: Make sure that ``sayhello`` recipe :term:`DEPENDS` on ``libhello``
it_it: Assicurarsi che la ricetta ``sayhello`` :term:`DEPENDS` da ``libhello``

source: Make sure that ``sayhello`` recipe :term:`RDEPENDS` on ``libhello``
it_it: Assicurarsi che la ricetta ``sayhello`` :term:`RDEPENDS` da ``libhello``

source: Make sure you're properly set up to build a new image (see the BSP README and/or the widely available basic documentation that discusses how to build images).
it_it: Assicurarsi di essere configurato correttamente per creare una nuova immagine (consultare il file README del BSP e/o la documentazione di base ampiamente disponibile che illustra come creare immagini).

source: Make sure your :term:`Build Host` meets the following requirements:
it_it: Assicurarsi che il proprio :term:`Build Host` soddisfi i seguenti requisiti:

source: Making Images More Secure
it_it: Come Rendere le Immagini più Sicure

source: Manually cloning the required repositories. Follow:
it_it: Clonando manualmente i repository necessari. Seguire le istruzioni riportate in:

source: Manuals
it_it: Manuali

source: Many developers look through the :yocto_docs:`All-in-one 'Mega' Manual </singleindex.html>` for a concept or term by doing a search through the whole page. This manual is a concatenation of the core set of Yocto Project manual. Thus, a simple string search using Ctrl-F in this manual produces all the "hits" for a desired term or concept. Once you find the area in which you are interested, you can display the actual manual, if desired. It is also possible to use the search bar in the menu or in the left navigation pane.
it_it: Molti sviluppatori consultano il manuale :yocto_docs:`All-in-one 'Mega' Manual </singleindex.html>` per trovare un concetto o un termine effettuando una ricerca nell'intera pagina. Questo manuale è una concatenazione del set di manuali principali di Yocto Project. Pertanto, una semplice ricerca testuale tramite Ctrl+F all'interno di questo documento mostra tutte le corrispondenze per il termine o il concetto desiderato. Una volta individuata l'area di interesse, è possibile visualizzare il manuale effettivo, se lo si desidera. È inoltre possibile utilizzare la barra di ricerca presente nel menu o nel pannello di navigazione sinistro.

source: Marta Rybczynska: <marta DOT rybczynska [at] ygreky [dot] com> `Public key <https://keys.openpgp.org/search?q=marta.rybczynska@ygreky.com>`__
it_it: Marta Rybczynska: <marta DOT rybczynska [at] ygreky [dot] com> `Chiave pubblica <https://keys.openpgp.org/search?q=marta.rybczynska@ygreky.com>`__
